brew "bat"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "node"
brew "opencode"
brew "python@3.14"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "uv"

cask "iterm2"
cask "dbeaver-community"